# -*- coding: utf-8 -*-
"""
@Time    :2022/8/9 15:57
@version :Python3.7.4
@Software:pycharm2020.3.2.
"""
"""
单分支：
    if 条件:
        代码块
运行的逻辑：判断条件，条件结果为真（True）时，进入代码块，并且运行代码块；否则不会进入代码块运行
执行其他行的代码

if后面的条件内容：
    可以使用比较运算符 > < >= <= == !=
    逻辑运算符：and ，or ， not
    成员运算符：in  ，not in
"""



"""
双项分支：
if 条件：
    代码块1
else:
    代码块2
"""


"""
多项分支
if 条件：
    代码块1
elif 条件：  
    代码块2
elif 条件：
    代码块3
。。。。
else:
    其他代码块
"""



"""
巢状分支：
if 条件：
    if 条件
        代码块1
    elif 条件
        代码块
    elif 条件
        代码块
    else
elif 条件：
    代码块2
elif 条件：
    代码块3
else:
    其他代码块
"""
