# -*- coding: utf-8 -*-
"""
@Time    :2022/8/14 17:42
@version :Python3.7.4
@Software:pycharm2020.3.2.
"""
"""类中的属性有：
    1.类属性：整个类的属性特征
    定义在类中，不是在函数中的属性；
    公有类属性：
        不已两个下划线开头的,可以在类里面和类外面去使用，子类也可以使用（继承父类的叫子类）
        调用方法：类名.属性名
    私有类属性：
        以两个下划线开头的
        只可以自己类里面去用，出了这个类就用不了了
        调用方法：类名.属性名

    2.实例属性：
    实例对象的属性特征，定义在构造方法（__init__）中的属性
    公有实例属性：
        不已两个下划线开头的,可以在类里面和类外面去使用，子类也可以使用（继承父类的叫子类）
        调用方法：对象名.属性名
    私有实例属性:
        以两个下划线开头的,只可以自己类里面去用，出了这个类就用不了了
"""



